1. В интерфесе `Question Insert` определена обязательная функция вывода вопроса
2. В классе `Question` находится основная структура вопроса, конструктор и функция вывода
3. В финальном классе `ExtendedQuestion`, наследующем класс `Question` находится расширенная версия вопроса
4. Вопросы и ответы, а также их значения выгружаются из БД, а в БД из админки
5. После того как пользователь ответил на все вопросы, логика файла `answer.php` расчитывает значения ответов и выдает соответствующий результат